#pragma once

#include "Tools.h"
#include "GW13762.h"

//// CTEST_3762PROTOCAL

enum AFN
{
	AFN00=0,AFN01,AFN02,AFN03,AFN04,AFN05,AFN06,AFN10=0X10,AFN11,AFN12,AFN13,AFNF0=0XF0
};
#include "CDTL2007.h"
class CTEST_3762PROTOCAL : public CWnd,public cDTL2007
{
	DECLARE_DYNAMIC(CTEST_3762PROTOCAL)

public:
	CTEST_3762PROTOCAL();
	virtual ~CTEST_3762PROTOCAL();
	void C3762_TEST(HTREEITEM hTree);//方案处理函数
	bool testProtocal(LPVOID   pParam);

	
	CTools m_tool;
	

protected:
	DECLARE_MESSAGE_MAP()

	//-------------------------------------------------
	//【函数名称】  INT8U  QueAFNFNBufCnt(INT8U List,INT8U &vDstAFN,INT16U *vDstBuf,INT8U &vDstCnt);
	//【函数功能】  查询列表和AFN，FN的对应关系
	//【参数说明】        
	//【I:	输入】   AFN，FNBUF和个数
	//【O:	输出】    
	//【返回值	】  DACK_SUCESS等  
	//【全局变量】       
	//【特殊说明】           
	//【开发者	】  杨虎岳  【日期】 2016年6月28日
	//【描  　述】 原始版本
	//-------------------------------------------------
	//【修改人	】     【日期】
	//【描  　述】
	INT16U * QueAFNFNBufCnt(INT8U List,INT8U &vDstAFN,INT8U &ack,INT8U &vDstCnt);
	//-------------------------------------------------
	//【函数名称】  INT8U TEST_3762AFNMoreFN(INT8U AFN,INT16U *vSrcFnBuf,INT8U vSrcFnCnt)
	//【函数功能】  测试AFN中多个FN
	//【参数说明】        
	//【I:	输入】   AFN，FNBUF和个数
	//【O:	输出】    
	//【返回值	】  DACK_SUCESS等  
	//【全局变量】       
	//【特殊说明】           
	//【开发者	】  杨虎岳  【日期】 2016年6月28日
	//【描  　述】 原始版本
	//-------------------------------------------------
	//【修改人	】     【日期】
	//【描  　述】
	INT8U  TEST_3762AFNMoreFN(INT8U AFN,INT16U *vSrcFnBuf,INT8U vSrcFnCnt);
	INT8U TEST_3762AFNFN(INT8U AFN,INT16U FN);
	void  StaSucessCnt(INT8U ack,INT8U &allSucesscnt,INT8U &failCnt);
	//-------------------------------------------------
	//【函数名称】  INT8U Test376Pct_AFNF01(INT16U FN)
	//【函数功能】  测试AFN=0x01的功能 
	//【参数说明】        
	//【I:	输入】   FN
	//【O:	输出】    
	//【返回值	】  DACK_SUCESS等  
	//【全局变量】       
	//【特殊说明】           
	//【开发者	】  杨虎岳  【日期】 2016年6月28日
	//【描  　述】 原始版本
	//-------------------------------------------------
	//【修改人	】     【日期】
	//【描  　述】
	INT8U Test376Pct_AFNF01(INT16U FN);
	//-------------------------------------------------
	//【函数名称】  INT8U Test376Pct_AFNF02(INT16U FN)
	//【函数功能】  测试AFN=0x01的功能 
	//【参数说明】        
	//【I:	输入】   FN
	//【O:	输出】    
	//【返回值	】  DACK_SUCESS等  
	//【全局变量】       
	//【特殊说明】           
	//【开发者	】  杨虎岳  【日期】 2016年6月28日
	//【描  　述】 原始版本
	//-------------------------------------------------
	//【修改人	】     【日期】
	//【描  　述】
	INT8U Test376Pct_AFNF02(INT16U FN);
	//-------------------------------------------------
	//【函数名称】  INT8U Test376Pct_AFNF03(INT16U FN)
	//【函数功能】  测试AFN=0x03的功能 
	//【参数说明】        
	//【I:	输入】   FN
	//【O:	输出】    
	//【返回值	】  DACK_SUCESS等  
	//【全局变量】       
	//【特殊说明】           
	//【开发者	】  杨虎岳  【日期】 2016年6月28日
	//【描  　述】 原始版本
	//-------------------------------------------------
	//【修改人	】     【日期】
	//【描  　述】
	INT8U Test376Pct_AFNF03(INT16U FN);

		//-------------------------------------------------
	//【函数名称】  INT8U Test376Pct_AFNF04(INT16U FN)
	//【函数功能】  测试AFN=0x04的功能 
	//【参数说明】        
	//【I:	输入】   FN
	//【O:	输出】    
	//【返回值	】  DACK_SUCESS等  
	//【全局变量】       
	//【特殊说明】           
	//【开发者	】  杨虎岳  【日期】 2016年6月28日
	//【描  　述】 原始版本
	//-------------------------------------------------
	//【修改人	】     【日期】
	//【描  　述】
	INT8U Test376Pct_AFNF04(INT16U FN);
	//-------------------------------------------------
	//【函数名称】  INT8U Test376Pct_AFNF05(INT16U FN)
	//【函数功能】  测试AFN=0x05的功能 
	//【参数说明】        
	//【I:	输入】   FN
	//【O:	输出】    
	//【返回值	】  DACK_SUCESS等  
	//【全局变量】       
	//【特殊说明】           
	//【开发者	】  杨虎岳  【日期】 2016年6月28日
	//【描  　述】 原始版本
	//-------------------------------------------------
	//【修改人	】     【日期】
	//【描  　述】
	INT8U Test376Pct_AFNF05(INT16U FN);

	//-------------------------------------------------
	//【函数名称】  INT8U Test376Pct_AFNF10(INT16U FN)
	//【函数功能】  测试AFN=0x10的功能 
	//【参数说明】        
	//【I:	输入】   FN
	//【O:	输出】    
	//【返回值	】  DACK_SUCESS等  
	//【全局变量】       
	//【特殊说明】           
	//【开发者	】  杨虎岳  【日期】 2016年6月28日
	//【描  　述】 原始版本
	//-------------------------------------------------
	//【修改人	】     【日期】
	//【描  　述】
	INT8U Test376Pct_AFNF10(INT16U FN);

	//-------------------------------------------------
	//【函数名称】  INT8U Test376Pct_AFNF11(INT16U FN)
	//【函数功能】  测试AFN=0x11的功能 
	//【参数说明】        
	//【I:	输入】   FN
	//【O:	输出】    
	//【返回值	】  DACK_SUCESS等  
	//【全局变量】       
	//【特殊说明】           
	//【开发者	】  杨虎岳  【日期】 2016年6月28日
	//【描  　述】 原始版本
	//-------------------------------------------------
	//【修改人	】     【日期】
	//【描  　述】
	INT8U Test376Pct_AFNF11(INT16U FN);
		//-------------------------------------------------
	//【函数名称】  INT8U Test376Pct_AFNF12(INT16U FN)
	//【函数功能】  测试AFN=0x12的功能 
	//【参数说明】        
	//【I:	输入】   FN
	//【O:	输出】    
	//【返回值	】  DACK_SUCESS等  
	//【全局变量】       
	//【特殊说明】           
	//【开发者	】  杨虎岳  【日期】 2016年6月28日
	//【描  　述】 原始版本
	//-------------------------------------------------
	//【修改人	】     【日期】
	//【描  　述】
	INT8U Test376Pct_AFNF12(INT16U FN);
	//-------------------------------------------------
	//【函数名称】  INT8U Test376Pct_AFNF13(INT16U FN)
	//【函数功能】  测试AFN=0x13的功能 
	//【参数说明】        
	//【I:	输入】   FN
	//【O:	输出】    
	//【返回值	】  DACK_SUCESS等  
	//【全局变量】       
	//【特殊说明】           
	//【开发者	】  杨虎岳  【日期】 2016年6月28日
	//【描  　述】 原始版本
	//-------------------------------------------------
	//【修改人	】     【日期】
	//【描  　述】
	INT8U Test376Pct_AFNF13(INT16U FN);
};


